In [1]:
import pandas as pd

In [2]:
dataset =pd.read_csv("titanic.csv")

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   int64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 122.8+ KB

In [5]:
dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [16]:
y = dataset['Survived']
X = dataset[['Pclass', 'Sex', 'Age', 'SibSp',
       'Parch', 'Embarked']]

In [17]:
y

0       0
1       1
2       1
3       1
4       0
       ..
1304    0
1305    1
1306    0
1307    0
1308    0
Name: Survived, Length: 1309, dtype: int64

In [18]:
dataset.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
dataset.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.020370,-0.038354,0.028814,-0.055224,0.008942,0.031428
Survived,-0.020370,1.000000,-0.264710,-0.053695,0.002370,0.108919,0.233622
Pclass,-0.038354,-0.264710,1.000000,-0.408106,0.060832,0.018322,-0.558629
Age,0.028814,-0.053695,-0.408106,1.000000,-0.243699,-0.150917,0.178740
SibSp,-0.055224,0.002370,0.060832,-0.243699,1.000000,0.373587,0.160238
Parch,0.008942,0.108919,0.018322,-0.150917,0.373587,1.000000,0.221539
Fare,0.031428,0.233622,-0.558629,0.178740,0.160238,0.221539,1.000000

In [26]:
X

      Pclass     Sex   Age  SibSp  Parch Embarked
0          3    male  22.0      1      0        S
1          1  female  38.0      1      0        C
2          3  female  26.0      0      0        S
3          1  female  35.0      1      0        S
4          3    male  35.0      0      0        S
...      ...     ...   ...    ...    ...      ...
1304       3    male   NaN      0      0        S
1305       1  female  39.0      0      0        C
1306       3    male  38.5      0      0        S
1307       3    male   NaN      0      0        S
1308       3    male   NaN      1      1        C

[1309 rows x 6 columns]

In [29]:
sex = dataset['Sex']

In [36]:
sex = pd.get_dummies(sex, drop_first=True)

In [39]:
embarked = pd.get_dummies(dataset['Embarked'], drop_first=True)

In [40]:
pclass = pd.get_dummies(data=dataset['Pclass'], drop_first=True)

In [44]:
X = pd.concat([sex, pclass, embarked,dataset['SibSp'], dataset['Parch']], axis=1)

In [45]:
X

      male  2  3  Q  S  SibSp  Parch
0        1  0  1  0  1      1      0
1        0  0  0  0  0      1      0
2        0  0  1  0  1      0      0
3        0  0  0  0  1      1      0
4        1  0  1  0  1      0      0
...    ... .. .. .. ..    ...    ...
1304     1  0  1  0  1      0      0
1305     0  0  0  0  0      0      0
1306     1  0  1  0  1      0      0
1307     1  0  1  0  1      0      0
1308     1  0  1  0  0      1      1

[1309 rows x 7 columns]

In [47]:
y

0       0
1       1
2       1
3       1
4       0
       ..
1304    0
1305    1
1306    0
1307    0
1308    0
Name: Survived, Length: 1309, dtype: int64

In [50]:
from sklearn.model_selection import train_test_split

In [52]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.30, random_state=45)

In [54]:
X_train.shape, X_test.shape

((916, 7), (393, 7))

In [55]:
from sklearn.linear_model import LogisticRegression

In [56]:
LR = LogisticRegression()

In [57]:
LR.fit(X_train,y_train)

LogisticRegression()

In [61]:
yhat = LR.predict(X_test)

In [60]:
from sklearn.metrics import accuracy_score, confusion_matrix

In [78]:
accuracy_score(yhat, y_test)* 100

89.56743002544529

In [67]:
confusion_matrix(yhat,y_test)

array([[236,  25],
       [ 16, 116]], dtype=int64)

In [74]:
236+116

352

In [75]:
16+25

41

In [77]:
352/(352+41) * 100

89.56743002544529

In [79]:
import joblib

In [81]:
joblib.dump(LR, "titanic_surviver_prediction-acc-89.57.pk1")

['titanic_surviver_prediction-acc-89.57.pk1']